{
  "name": "Shreyas",
  "displayProfile": "project_images/Display_Profile.jpg",
  "headerTaglineOne": "Hello There! yes that was a Star-Wars reference and welcome to my website :)",
  "headerTaglineTwo": "My name is Shreyas, but you can call me Rey.\nI am a Software Engineer and Entrepreneur dedicated to supporting the mental health community.",
  "headerTaglineThree": " I am also a Lead Guitarist with a passion for rock music and an unshakable love for Linkin Park.",
  "aboutpara": "Growing up in Singapore, my journey in technology and engineering has been shaped by family, friends, and mentors whose innovative spirit and inspiring ideas, combined with my diverse experiences, have driven me to harness technology for societal impact. My fascination with technology emerged in childhood, particularly with solutions that prioritize exceptional design and user experience. This passion was further fueled by my admiration of Apple's approach to technology – where engaging, simple, and secure user experiences take center stage in their products. Now, I'm applying my expertise in software engineering and large-scale data systems to develop a platform addressing critical mental healthcare challenges, specifically targeting prohibitive costs, social stigma, and limited access to immediate professional support. This project embodies my vision of creating meaningful social impact through thoughtfully designed solutions.",
  "showBlog": false,
  "darkMode": true,
  "socials": [
    {
      "id": "1",
      "title": "Github",
      "link": "https://github.com/shreytheshreyas"
    },
    {
      "id": "2",
      "title": "LinkedIn",
      "link": "https://www.linkedin.com/in/shreyas-kumar98/"
    },
    {
      "id": "3",
      "title": "Instagram",
      "link": "https://www.instagram.com/reytheshreyas/"
    },
    {
      "id": "4",
      "title": "Email",
      "link": "mailto:shreyaskumar52@gmail.com"
    }
  ],
  "experiences": [
    { "id": "1",
      "companyName": "Singapore University of Techonology and Design",
      "role": "Full-Time Research Assistant: Machine Learning and Computer Vision",
      "Duration": "October 2023 to October 2024",
      "logo": "experience_images/sutd_logo.png",
      "experienceInfo": [
      "Orchestrated the analysis of global Twitter data, by crafting a robust LLM pipeline using the Langchain framework to accurately classify tweets into targeted activity categories. Enhanced the evaluation of activity likability across diverse cities by applying the Roberta-Base Sentiment Model for detailed sentiment analysis and leveraged Gensim for advanced topic clustering, significantly boosting the precision of data-driven insights.", "Engineered a Video Processing Pipeline, integrating a Video Decryption Algorithm to access encrypted footage from deployed sensors, utilizing YOLOv8 for precise object detection and image classification, and BoTSORT for seamless object tracking across video frames. Enhanced with D3.js, this workflow produced detailed visualizations of activity patterns across Singapore’s recreational facilities, providing essential insights to the Urban Redevelopment Authority. These insights directly influenced strategic decisions in the design and optimization of the city's activity centers.", "Conducted detailed and comparative experiments with multiple Multi-Object-Tracking algorithms, including BoT-SORT-ReID, BoT-SORT, and OCSORT, to identify the most suitable option for our research, focused on recreational activity tracking. Through rigorous testing, I achieved a MOTA (Multiple Object Tracking Accuracy) score of 80% and a ReID (Re-identification) score of 88.9% on our custom dataset when utilizing BoT-SORT-ReID, leading to the selection of the respective algorithm for our object tracking pipeline due to its superior performance and alignment with our project objectives.", "Collaborated with interdisciplinary research teams on the strategic deployment of camera sensors across various recreational locations in the island, enabling the collection of vital footage data for our video processing pipeline. This initiative was crucial in leveraging the gathered data to analyze and interpret societal behavior patterns, thereby enriching our understanding and guiding decision-making processes concerning urban activities in these regions.", "Collaborated with colleagues to construct a classification pipeline, significantly contributing to exploratory data analysis, feature engineering, and selection of the dataset. Utilized scikit-learn and statsmodels for comprehensive hypothesis testing, enhancing our understanding of key dataset features. This pivotal project dramatically increased model accuracy and predictive capabilities, facilitating the detection of critical mosquito clusters in Singapore, directly correlating to a surge in dengue cases in these areas."
      ]
    },
    {
      "id": "2",
      "companyName": "Nested Technologies Pte Ltd",
      "role": "Backend Software Engineer Intern",
      "Duration": "January 2022 to June 2022",
      "logo": "experience_images/nested_logo.png",
      "experienceInfo": [
      "Architected and implemented the database schemas for three key applications within the company, utilizing Django and Sequelize ORM frameworks. Managed and maintained these Database-Management-Systems effectively, ensuring optimal performance and data integrity. Additionally, I was responsible for overseeing user role management for developers, facilitating efficient user testing and deployment processes.", "Designed and engineered an advanced scheduling system for a critical web application, utilizing the Django framework to efficiently manage cron jobs. Developed and maintained a dedicated PostgreSQL database for detailed logging of scheduling actions. Integrated SendGrid API to ensure reliable email delivery and deployed the application on AWS EC2 for robust hosting of the mailing service feature. Additionally, I consistently provided troubleshooting support and system enhancements to optimize performance and ensure system reliability.", "Contributed significantly to the deployment and troubleshooting of a vision model pipeline for one of the company's architectural applications, which employed the U-net architecture for accurate image segmentation. I additionally integrated the model's inference capabilities into the application using the Flask framework and ensured scalable deployment via AWS’ EC2 service. This strategic implementation allowed the application to precisely assess material needs for interior design projects based on apartment floor plans, greatly enhancing both operational efficiency and the accuracy of resource planning for the company.","Administered the strategic migration of two principal company applications from AWS ECS to AWS Kubernetes Service (EKS) to accommodate significant user growth. This transition was crucial for implementing load-balancing solutions to manage increased network traffic, ensuring continuous application performance and scalability.","Facilitated in the development of a web scraping service for a key company application, leveraging the BeautifulSoup, Scrapy, and Requests libraries. This project successfully achieved the application's objective of constructing robust synthetic datasets, essential for enhancing data-driven decision-making processes." 
      ]
    },
    {
      "id": "3",
      "companyName": "Digipasar Pte Ltd",
      "role": "Product Management Inten",
      "Duration": "June 2020 to August 2020",
      "logo": "experience_images/digipasar_logo.png",
      "experienceInfo": [
      "Collaborated with development, operations, and design teams to create a personal finance application that utilizes image processing and Optical-Character-Recognition (OCR) technology. This innovative application converts receipts and invoices into digital formats and records them in a database, providing users with a platform to view and manage their transaction history over selected time periods.", "Spearheaded data curation efforts for vision models within the company’s personal finance application by coordinating surveys and establishing donation programs throughout Singapore to amass a comprehensive receipt dataset. Developed and executed data cleaning scripts to accurately categorize receipts by transaction types, including transport, groceries, and food. Further enhanced the application by conducting exploratory data analysis on the aggregated image receipt dataset using OpenCV and Pandas, significantly improving accuracy and user experience as the insights were integrated by the development team.","layed a pivotal role in enhancing the user interface of the finance application by leading user research initiatives and crafting an intuitive user experience design. Developed multiple design wireframes and executed A/B testing for a comparative analysis of usability options. Collaboratively engaged with the development team to select and implement the most feasible and impactful design solutions moving forward.","Collaborated closely with the development and operations teams to orchestrate comprehensive user testing for the application, engaging a select group of users recruited by the company. This process was essential for gathering valuable feedback on potential improvements in application features and overall user experience, directly influencing subsequent enhancements."  
      ]
    },
    {
      "id": "4",
      "companyName": "Ministry of Singapore Defence: Singapore Armed Forces",
      "role": "Data Analyst",
      "Duration": "July 2017 to May 2019",
      "logo": "experience_images/saf_logo.png",
      "experienceInfo": [
      "Managed manpower and logistical databases for reservist soldiers across multiple battalions within my brigade, ensuring accurate tracking and recording of attendance during various military training phases. This included monitoring presence, medical leaves, and unauthorized absences. Additionally, I was responsible for regularly updating these databases to reflect changes such as retirements, shifts in key appointment holders among commanding officers, and the integration of new soldiers into the battalions.", "Conducted data analysis from the databases I managed to accurately estimate the battalion's food requirements during in-camp periods and extended field training sessions. This analysis ensured optimal provisioning and efficient use of resources, supporting the battalion's operational readiness during multi-day or week-long training exercises.","Leveraged data analytics from managed databases to detect patterns and track the locations of unauthorized absentee soldiers, identified as serious violators of military law. The insights derived facilitated successful apprehension and resolution of their cases in military court, ultimately ensuring adherence to disciplinary standards.","Appointed by military commanders as the official in charge on multiple occasions, I successfully led and coordinated key unit activities for significant events, including Singapore’s Army Half Marathon and the National Day Appreciation Dinner in 2018. These leadership roles underscored my ability to manage large-scale events and contribute to national celebrations effectively."]
    }
  ],
  "projects": [
    {
      "id": "1",
      "title": "AI Accelerated Laser Tag System",
      "description": "Final Year Internet of Things Gaming System Project",
      "imageSrc": "project_images/Computer_Engineering_Capstone_Team_Final.jpg",
      "url": "https://github.com/shreytheshreyas/Laser-Tag/"
    },
    {
      "id": "2",
      "title": "PhysioTech - Assistive Technology for Physiotheraphy",
      "description": "Medical Imaging pipeline for patients undergoing Physiotheraphy",
      "imageSrc": "project_images/PhysioTech_Project.jpg",
      "url": "https://github.com/shreytheshreyas/PhysioTech-Assistive-Technology-for-Physiotheraphy/"
    },
    {
      "id": "3",
      "title": "NUS x MIT Medical AI Competion Project",
      "description": "Medical Imaging Hackathon Project for Tumor Detection",
      "imageSrc": "project_images/datathon.jpg",
      "url": "https://github.com/shreytheshreyas/NUS-and-MIT-Applied-AI-Medical-Competition-2022"
    },
    {
      "id": "4",
      "title": "Project-BOYD-IOT-Healthcare-Monitoring-for-Elderly",
      "description": "Intenet of Things Project for Nursing Home and Medical Institutions",
      "imageSrc": "project_images/iot.jpg",
      "url": "https://github.com/shreytheshreyas/Project-BOYD-IOT-Healthcare-Monitoring-for-Elderly/"
    },
    {
      "id": "5",
      "title": "Holiday Carpark Availability Prediction Model and Big Data Analysis",
      "description": "Big Data Analysis Project",
      "imageSrc": "project_images/parking.jpg",
      "url": "https://github.com/shreytheshreyas/Holiday-Carpark-Availability-Prediction-Model-and-Big-Data-Analysis/"
    },
    {
      "id": "6",
      "title": "Database System Query Optimization and Analysis Project",
      "description": "Database Project for Searching and Indexing Algorithms",
      "imageSrc": "project_images/database2.jpg",
      "url": "https://github.com/shreytheshreyas/Database-Management-System-Implementation-Project/"
    },
    {
      "id": "7",
      "title": "Office Meeting Scheduling System - PL\\ SQL Relational Database Management System Project",
      "description": "Databse Design and Backend Development Project",
      "imageSrc": "project_images/database1.jpg",
      "url": "https://github.com/shreytheshreyas/Database-Systems-and-Database-Design-Team-Project/"
    },
    {
      "id": "8",
      "title": "ARM Pipelined Processor - Computer Hardware Architecture Project",
      "description": "System on a Chip Project",
      "imageSrc": "project_images/processor.jpg",
      "url": "https://github.com/shreytheshreyas/NUS-Computer-Architecture-Pipelined-Processor-Implementation-with-Hazard-Control-Logic/"
    },
    {
      "id": "10",
      "title": "Quotify-Bot - NUS HacknRoll 2021",
      "description": "Machine Learning & Web Development Project",
      "imageSrc": "project_images/quotify.jpg",
      "url": "https://github.com/shreytheshreyas/"
    },
    {
      "id": "11",
      "title": "EZ-Manager Project Management System - OOP Software Engineering Project",
      "description": "Software Engineering Project Application for Managers",
      "imageSrc": "project_images/pm.jpg",
      "url": "https://github.com/shreytheshreyas/"
    },
    {
      "id": "12",
      "title": "Real Time Operating Systems Project",
      "description": "Embedded Systems Project",
      "imageSrc": "project_images/rtos_project.jpg",
      "url": "https://github.com/shreytheshreyas/"
    },
    {
      "id": "13",
      "title": "C.H.A.P.I - Mental Well Being Application : NUS Orbital 2020 - Summer Developers Competition",
      "description": "Mental Health Mobile Application",
      "imageSrc": "project_images/mental_wellbeing.jpg",
      "url": "https://github.com/shreytheshreyas/Orbital-2020---C.H.A.P.I/"
    },
    {
      "id": "14",
      "title": "Computer Engineering Principles Part - 2 Project: Alex The Rescue Robot",
      "description": "Embedded Systems Design & Development",
      "imageSrc": "project_images/alex.jpg",
      "url": "https://github.com/shreytheshreyas/"
    },
    {
      "id": "15",
      "title": "Computer Engineering Principles Part -1 Project: The A-MAZE-ing Race",
      "description": "Embedded Systems Design & Development",
      "imageSrc": "project_images/maze_race.jpg",
      "url": "https://github.com/shreytheshreyas/"
    },
    {
      "id": "16",
      "title": "The Memory Game - High School Final Year Computer Science Project",
      "description": "Software Engineering & Development",
      "imageSrc": "project_images/memory.jpg",
      "url": "https://github.com/shreytheshreyas/"
    }
  ],
  "volunteering": [
    {
      "id": "1",
      "title": "Calm Collective Asia: Mental Health Facilitator Traniee",
      "description": "I am currently a Calm Collective Asia scholarship recipient undergoing training as a mental health care facilitator and community peer supporter. My mission is to assist individuals across asia facing severe psychological challenges, offering support to help them navigate the difficult times associated with their mental health conditions."
    },
    {
      "id": "2",
      "title": "NUS Peer and Psychological Support Community: Mental Health Advocate and Peer Supporter",
      "description": "I Completed an extensive peer support training program through NUS and CHAT Hub Singapore (Singapore Institute of Mental Health Initiative), specializing in severe mental health conditions and suicide prevention among young adults. I later served as a mental health peer supporter in my final year, providing emotional support and guidance to help students navigate academic challenges and deal with their respective emotional problems."
    },
    {
      "id": "3",
      "title": "NUS Community Service Club: Student Volunteer",
      "description": "I contributed as a volunteer in supporting children under the age of 12 with learning disabilities and psychological disorders, such as Down syndrome, autism, and chronic anxiety. My role involved engaging the children in suitable recreational activities, ensuring they received their food on time, and helping manage their rest schedules to support their well-being and comfort."
    },
    {
      "id": "4",
      "title": "Singapore Institute of Mental Health: Summer Volunteer 2013",
      "description": "I supported hospital patients undergoing treatment for severe psychiatric disorders as a summer volunteer 11 years ago. Although my responsibilities were limited due to my age, I diligently assisted with ensuring patients adhered to their daily routines, including meal intake, medication schedules, and exercise regimens. I regularly reported these activities to the nursing staff responsible for the clinic, contributing to the overall care and management of patient treatment."
    }
  ],
  "hobbies": [
    {
      "id": "1",
      "title": "Singapore Institute of Mental Health: Summer Volunteer 2013",
      "description": "I supported hospital patients undergoing treatment for severe psychiatric disorders as a summer volunteer 11 years ago. Although my responsibilities were limited due to my age, I diligently assisted with ensuring patients adhered to their daily routines, including meal intake, medication schedules, and exercise regimens. I regularly reported these activities to the nursing staff responsible for the clinic, contributing to the overall care and management of patient treatment."
    },
    {
      "id": "3",
      "title": "NUS Toastmasters Club",
      "description": "Organised events to help individuals at NUS to improve their public speaking skills and improve their confidence while meeting new people."
    },
    {
      "id": "4",
      "title": "NUS Indian Cultural Society",
      "description": "Vice-Publicity Head, assisted in the photography and media during events such as Deepavali and Holi during my Freshman Year of College."
    },
    {
      "id": "5",
      "title": "NUS Community Service Club",
      "description": "Collaborated with friends to help special needs children in Singapore and attend to them when they wanted company or somebody to play around with :)"
    }
  ]
}
